#-----------------------------------------------------------------
# パス設定
#-----------------------------------------------------------------
#
# 重複したパスを登録しない
typeset -U path
typeset -U manpath
typeset -U library_path

# パスを登録
# (N-/): 存在しないディレクトリは登録しない
#   パス(...): ...という条件にマッチするパスのみ残す
#           N: NULL_GLOBオプション設定
#              globがマッチしなかったり存在しないパスを無視する
#           -: シンボリックリンク先のパスを評価
#           /: ディレクトリのみ残す
path=($HOME/local/bin(N-/)
      $path
      /bin(N-/)
      /usr/*/bin(N-/)
      /usr/local/*/bin(N-/))

manpath=($HOME/local/share/man(N-/)
         /usr/*/man(N-/)
         /usr/local/*/man(N-/))

library_path=(
  /usr/local/*/lib(N-/)
)

#-----------------------------------------------------------------
# 環境変数
#-----------------------------------------------------------------
# エディタ
export EDITOR=vim
# 端末タイプ
export TERM=xterm-256color
